---
type: RibbonItem
namespace: Autodesk.Revit.UI
version: 2024
members: 11
tags: [revit-api, class]
---

# RibbonItem

`Autodesk.Revit.UI.RibbonItem` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Equals | — | `public override bool Equals ( Object obj )` |
| Method | GetContextualHelp | 2013 | `public ContextualHelp GetContextualHelp ()` |
| Method | SetContextualHelp | 2013 | `public void SetContextualHelp ( ContextualHelp contextualHelp )` |
| Property | Enabled | — | `public bool Enabled { get ; set ; }` |
| Property | ItemText | — | `public virtual string ItemText { get ; set ; }` |
| Property | ItemType | — | `public RibbonItemType ItemType { get ; }` |
| Property | LongDescription | — | `public string LongDescription { get ; set ; }` |
| Property | Name | — | `public string Name { get ; internal set ; }` |
| Property | ToolTip | — | `public string ToolTip { get ; set ; }` |
| Property | ToolTipImage | — | `public ImageSource ToolTipImage { get ; set ; }` |
| Property | Visible | 2011 | `public bool Visible { get ; set ; }` |